Microchip-MPLAB-Harmony/smartenergy/apps/metering_demo_freertos/firmware/src/packs/PIC32CX2051MTC128_DFP/component/mem2mem.h
/*
 * Component description for MEM2MEM
 *
 * Copyright (c) 2023 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2023-01-19T09:46:50Z */
#ifndef _PIC32CXMTC_MEM2MEM_COMPONENT_H_
#define _PIC32CXMTC_MEM2MEM_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR MEM2MEM                                      */
/* ************************************************************************** */

/* -------- MEM2MEM_THR : (MEM2MEM Offset: 0x00) (R/W 32) Transfer Holding Register -------- */
#define MEM2MEM_THR_THDATA_Pos                _UINT32_(0)                                          /* (MEM2MEM_THR) Transfer Holding Data Position */
#define MEM2MEM_THR_THDATA_Msk                (_UINT32_(0xFFFFFFFF) << MEM2MEM_THR_THDATA_Pos)     /* (MEM2MEM_THR) Transfer Holding Data Mask */
#define MEM2MEM_THR_THDATA(value)             (MEM2MEM_THR_THDATA_Msk & (_UINT32_(value) << MEM2MEM_THR_THDATA_Pos)) /* Assigment of value for THDATA in the MEM2MEM_THR register */
#define MEM2MEM_THR_Msk                       _UINT32_(0xFFFFFFFF)                                 /* (MEM2MEM_THR) Register Mask  */


/* -------- MEM2MEM_MR : (MEM2MEM Offset: 0x04) (R/W 32) Mode Register -------- */
#define MEM2MEM_MR_TSIZE_Pos                  _UINT32_(0)                                          /* (MEM2MEM_MR) Transfer Size Position */
#define MEM2MEM_MR_TSIZE_Msk                  (_UINT32_(0x3) << MEM2MEM_MR_TSIZE_Pos)              /* (MEM2MEM_MR) Transfer Size Mask */
#define MEM2MEM_MR_TSIZE(value)               (MEM2MEM_MR_TSIZE_Msk & (_UINT32_(value) << MEM2MEM_MR_TSIZE_Pos)) /* Assigment of value for TSIZE in the MEM2MEM_MR register */
#define   MEM2MEM_MR_TSIZE_T_8BIT_Val         _UINT32_(0x0)                                        /* (MEM2MEM_MR) The buffer size is defined in bytes.  */
#define   MEM2MEM_MR_TSIZE_T_16BIT_Val        _UINT32_(0x1)                                        /* (MEM2MEM_MR) The buffer size is defined in half-words (16-bit).  */
#define   MEM2MEM_MR_TSIZE_T_32BIT_Val        _UINT32_(0x2)                                        /* (MEM2MEM_MR) The buffer size is defined in words (32-bit). Default value.  */
#define MEM2MEM_MR_TSIZE_T_8BIT               (MEM2MEM_MR_TSIZE_T_8BIT_Val << MEM2MEM_MR_TSIZE_Pos) /* (MEM2MEM_MR) The buffer size is defined in bytes. Position  */
#define MEM2MEM_MR_TSIZE_T_16BIT              (MEM2MEM_MR_TSIZE_T_16BIT_Val << MEM2MEM_MR_TSIZE_Pos) /* (MEM2MEM_MR) The buffer size is defined in half-words (16-bit). Position  */
#define MEM2MEM_MR_TSIZE_T_32BIT              (MEM2MEM_MR_TSIZE_T_32BIT_Val << MEM2MEM_MR_TSIZE_Pos) /* (MEM2MEM_MR) The buffer size is defined in words (32-bit). Default value. Position  */
#define MEM2MEM_MR_Msk                        _UINT32_(0x00000003)                                 /* (MEM2MEM_MR) Register Mask  */


/* -------- MEM2MEM_IER : (MEM2MEM Offset: 0x08) ( /W 32) Interrupt Enable Register -------- */
#define MEM2MEM_IER_RXEND_Pos                 _UINT32_(0)                                          /* (MEM2MEM_IER) End of Transfer Interrupt Enable Position */
#define MEM2MEM_IER_RXEND_Msk                 (_UINT32_(0x1) << MEM2MEM_IER_RXEND_Pos)             /* (MEM2MEM_IER) End of Transfer Interrupt Enable Mask */
#define MEM2MEM_IER_RXEND(value)              (MEM2MEM_IER_RXEND_Msk & (_UINT32_(value) << MEM2MEM_IER_RXEND_Pos)) /* Assigment of value for RXEND in the MEM2MEM_IER register */
#define MEM2MEM_IER_RXBUFF_Pos                _UINT32_(1)                                          /* (MEM2MEM_IER) Buffer Full Interrupt Enable Position */
#define MEM2MEM_IER_RXBUFF_Msk                (_UINT32_(0x1) << MEM2MEM_IER_RXBUFF_Pos)            /* (MEM2MEM_IER) Buffer Full Interrupt Enable Mask */
#define MEM2MEM_IER_RXBUFF(value)             (MEM2MEM_IER_RXBUFF_Msk & (_UINT32_(value) << MEM2MEM_IER_RXBUFF_Pos)) /* Assigment of value for RXBUFF in the MEM2MEM_IER register */
#define MEM2MEM_IER_Msk                       _UINT32_(0x00000003)                                 /* (MEM2MEM_IER) Register Mask  */


/* -------- MEM2MEM_IDR : (MEM2MEM Offset: 0x0C) ( /W 32) Interrupt Disable Register -------- */
#define MEM2MEM_IDR_RXEND_Pos                 _UINT32_(0)                                          /* (MEM2MEM_IDR) End of Transfer Interrupt Disable Position */
#define MEM2MEM_IDR_RXEND_Msk                 (_UINT32_(0x1) << MEM2MEM_IDR_RXEND_Pos)             /* (MEM2MEM_IDR) End of Transfer Interrupt Disable Mask */
#define MEM2MEM_IDR_RXEND(value)              (MEM2MEM_IDR_RXEND_Msk & (_UINT32_(value) << MEM2MEM_IDR_RXEND_Pos)) /* Assigment of value for RXEND in the MEM2MEM_IDR register */
#define MEM2MEM_IDR_RXBUFF_Pos                _UINT32_(1)                                          /* (MEM2MEM_IDR) Buffer Full Interrupt Disable Position */
#define MEM2MEM_IDR_RXBUFF_Msk                (_UINT32_(0x1) << MEM2MEM_IDR_RXBUFF_Pos)            /* (MEM2MEM_IDR) Buffer Full Interrupt Disable Mask */
#define MEM2MEM_IDR_RXBUFF(value)             (MEM2MEM_IDR_RXBUFF_Msk & (_UINT32_(value) << MEM2MEM_IDR_RXBUFF_Pos)) /* Assigment of value for RXBUFF in the MEM2MEM_IDR register */
#define MEM2MEM_IDR_Msk                       _UINT32_(0x00000003)                                 /* (MEM2MEM_IDR) Register Mask  */


