Microchip-MPLAB-Harmony/smartenergy/apps/metering_demo_freertos/firmware/src/packs/PIC32CX2051MTC128_DFP/component/mem2mem.h
/* -------- MEM2MEM_PTSR : (MEM2MEM Offset: 0x124) ( R/ 32) Transfer Status Register -------- */
#define MEM2MEM_PTSR_RXTEN_Pos                _UINT32_(0)                                          /* (MEM2MEM_PTSR) Receiver Transfer Enable Position */
#define MEM2MEM_PTSR_RXTEN_Msk                (_UINT32_(0x1) << MEM2MEM_PTSR_RXTEN_Pos)            /* (MEM2MEM_PTSR) Receiver Transfer Enable Mask */
#define MEM2MEM_PTSR_RXTEN(value)             (MEM2MEM_PTSR_RXTEN_Msk & (_UINT32_(value) << MEM2MEM_PTSR_RXTEN_Pos)) /* Assigment of value for RXTEN in the MEM2MEM_PTSR register */
#define MEM2MEM_PTSR_TXTEN_Pos                _UINT32_(8)                                          /* (MEM2MEM_PTSR) Transmitter Transfer Enable Position */
#define MEM2MEM_PTSR_TXTEN_Msk                (_UINT32_(0x1) << MEM2MEM_PTSR_TXTEN_Pos)            /* (MEM2MEM_PTSR) Transmitter Transfer Enable Mask */
#define MEM2MEM_PTSR_TXTEN(value)             (MEM2MEM_PTSR_TXTEN_Msk & (_UINT32_(value) << MEM2MEM_PTSR_TXTEN_Pos)) /* Assigment of value for TXTEN in the MEM2MEM_PTSR register */
#define MEM2MEM_PTSR_RXCBEN_Pos               _UINT32_(16)                                         /* (MEM2MEM_PTSR) Receiver Circular Buffer Enable Position */
#define MEM2MEM_PTSR_RXCBEN_Msk               (_UINT32_(0x1) << MEM2MEM_PTSR_RXCBEN_Pos)           /* (MEM2MEM_PTSR) Receiver Circular Buffer Enable Mask */
#define MEM2MEM_PTSR_RXCBEN(value)            (MEM2MEM_PTSR_RXCBEN_Msk & (_UINT32_(value) << MEM2MEM_PTSR_RXCBEN_Pos)) /* Assigment of value for RXCBEN in the MEM2MEM_PTSR register */
#define MEM2MEM_PTSR_TXCBEN_Pos               _UINT32_(18)                                         /* (MEM2MEM_PTSR) Transmitter Circular Buffer Enable Position */
#define MEM2MEM_PTSR_TXCBEN_Msk               (_UINT32_(0x1) << MEM2MEM_PTSR_TXCBEN_Pos)           /* (MEM2MEM_PTSR) Transmitter Circular Buffer Enable Mask */
#define MEM2MEM_PTSR_TXCBEN(value)            (MEM2MEM_PTSR_TXCBEN_Msk & (_UINT32_(value) << MEM2MEM_PTSR_TXCBEN_Pos)) /* Assigment of value for TXCBEN in the MEM2MEM_PTSR register */
#define MEM2MEM_PTSR_ERR_Pos                  _UINT32_(24)                                         /* (MEM2MEM_PTSR) Transfer Bus Error Position */
#define MEM2MEM_PTSR_ERR_Msk                  (_UINT32_(0x1) << MEM2MEM_PTSR_ERR_Pos)              /* (MEM2MEM_PTSR) Transfer Bus Error Mask */
#define MEM2MEM_PTSR_ERR(value)               (MEM2MEM_PTSR_ERR_Msk & (_UINT32_(value) << MEM2MEM_PTSR_ERR_Pos)) /* Assigment of value for ERR in the MEM2MEM_PTSR register */
#define MEM2MEM_PTSR_Msk                      _UINT32_(0x01050101)                                 /* (MEM2MEM_PTSR) Register Mask  */


/* -------- MEM2MEM_PWPMR : (MEM2MEM Offset: 0x128) (R/W 32) Write Protection Mode Register -------- */
#define MEM2MEM_PWPMR_WPPTREN_Pos             _UINT32_(0)                                          /* (MEM2MEM_PWPMR) Write Protection Pointer Registers Enable Position */
#define MEM2MEM_PWPMR_WPPTREN_Msk             (_UINT32_(0x1) << MEM2MEM_PWPMR_WPPTREN_Pos)         /* (MEM2MEM_PWPMR) Write Protection Pointer Registers Enable Mask */
#define MEM2MEM_PWPMR_WPPTREN(value)          (MEM2MEM_PWPMR_WPPTREN_Msk & (_UINT32_(value) << MEM2MEM_PWPMR_WPPTREN_Pos)) /* Assigment of value for WPPTREN in the MEM2MEM_PWPMR register */
#define MEM2MEM_PWPMR_WPCTREN_Pos             _UINT32_(1)                                          /* (MEM2MEM_PWPMR) Write Protection Counter Registers Enable Position */
#define MEM2MEM_PWPMR_WPCTREN_Msk             (_UINT32_(0x1) << MEM2MEM_PWPMR_WPCTREN_Pos)         /* (MEM2MEM_PWPMR) Write Protection Counter Registers Enable Mask */
#define MEM2MEM_PWPMR_WPCTREN(value)          (MEM2MEM_PWPMR_WPCTREN_Msk & (_UINT32_(value) << MEM2MEM_PWPMR_WPCTREN_Pos)) /* Assigment of value for WPCTREN in the MEM2MEM_PWPMR register */
#define MEM2MEM_PWPMR_WPCREN_Pos              _UINT32_(2)                                          /* (MEM2MEM_PWPMR) Write Protection Control Register Enable Position */
#define MEM2MEM_PWPMR_WPCREN_Msk              (_UINT32_(0x1) << MEM2MEM_PWPMR_WPCREN_Pos)          /* (MEM2MEM_PWPMR) Write Protection Control Register Enable Mask */
#define MEM2MEM_PWPMR_WPCREN(value)           (MEM2MEM_PWPMR_WPCREN_Msk & (_UINT32_(value) << MEM2MEM_PWPMR_WPCREN_Pos)) /* Assigment of value for WPCREN in the MEM2MEM_PWPMR register */
#define MEM2MEM_PWPMR_WPKEY_Pos               _UINT32_(8)                                          /* (MEM2MEM_PWPMR) Write Protection Key Position */
#define MEM2MEM_PWPMR_WPKEY_Msk               (_UINT32_(0xFFFFFF) << MEM2MEM_PWPMR_WPKEY_Pos)      /* (MEM2MEM_PWPMR) Write Protection Key Mask */
#define MEM2MEM_PWPMR_WPKEY(value)            (MEM2MEM_PWPMR_WPKEY_Msk & (_UINT32_(value) << MEM2MEM_PWPMR_WPKEY_Pos)) /* Assigment of value for WPKEY in the MEM2MEM_PWPMR register */
#define   MEM2MEM_PWPMR_WPKEY_PASSWD_Val      _UINT32_(0x504443)                                   /* (MEM2MEM_PWPMR) Writing any other value in this field aborts the write operation. Always reads as 0.  */
#define MEM2MEM_PWPMR_WPKEY_PASSWD            (MEM2MEM_PWPMR_WPKEY_PASSWD_Val << MEM2MEM_PWPMR_WPKEY_Pos) /* (MEM2MEM_PWPMR) Writing any other value in this field aborts the write operation. Always reads as 0. Position  */
#define MEM2MEM_PWPMR_Msk                     _UINT32_(0xFFFFFF07)                                 /* (MEM2MEM_PWPMR) Register Mask  */


/** \brief MEM2MEM register offsets definitions */
#define MEM2MEM_THR_REG_OFST           _UINT32_(0x00)      /* (MEM2MEM_THR) Transfer Holding Register Offset */
#define MEM2MEM_MR_REG_OFST            _UINT32_(0x04)      /* (MEM2MEM_MR) Mode Register Offset */
#define MEM2MEM_IER_REG_OFST           _UINT32_(0x08)      /* (MEM2MEM_IER) Interrupt Enable Register Offset */
#define MEM2MEM_IDR_REG_OFST           _UINT32_(0x0C)      /* (MEM2MEM_IDR) Interrupt Disable Register Offset */
#define MEM2MEM_IMR_REG_OFST           _UINT32_(0x10)      /* (MEM2MEM_IMR) Interrupt Mask Register Offset */
#define MEM2MEM_ISR_REG_OFST           _UINT32_(0x14)      /* (MEM2MEM_ISR) Interrupt Status Register Offset */
#define MEM2MEM_WPMR_REG_OFST          _UINT32_(0x18)      /* (MEM2MEM_WPMR) Write Protection Mode Register Offset */
#define MEM2MEM_RPR_REG_OFST           _UINT32_(0x100)     /* (MEM2MEM_RPR) Receive Pointer Register Offset */
#define MEM2MEM_RCR_REG_OFST           _UINT32_(0x104)     /* (MEM2MEM_RCR) Receive Counter Register Offset */
#define MEM2MEM_TPR_REG_OFST           _UINT32_(0x108)     /* (MEM2MEM_TPR) Transmit Pointer Register Offset */
#define MEM2MEM_TCR_REG_OFST           _UINT32_(0x10C)     /* (MEM2MEM_TCR) Transmit Counter Register Offset */
#define MEM2MEM_RNPR_REG_OFST          _UINT32_(0x110)     /* (MEM2MEM_RNPR) Receive Next Pointer Register Offset */
#define MEM2MEM_RNCR_REG_OFST          _UINT32_(0x114)     /* (MEM2MEM_RNCR) Receive Next Counter Register Offset */
#define MEM2MEM_TNPR_REG_OFST          _UINT32_(0x118)     /* (MEM2MEM_TNPR) Transmit Next Pointer Register Offset */
#define MEM2MEM_TNCR_REG_OFST          _UINT32_(0x11C)     /* (MEM2MEM_TNCR) Transmit Next Counter Register Offset */
#define MEM2MEM_PTCR_REG_OFST          _UINT32_(0x120)     /* (MEM2MEM_PTCR) Transfer Control Register Offset */
#define MEM2MEM_PTSR_REG_OFST          _UINT32_(0x124)     /* (MEM2MEM_PTSR) Transfer Status Register Offset */
#define MEM2MEM_PWPMR_REG_OFST         _UINT32_(0x128)     /* (MEM2MEM_PWPMR) Write Protection Mode Register Offset */

