Microchip-MPLAB-Harmony/smartenergy/apps/metering_demo_freertos/firmware/src/packs/PIC32CX2051MTC128_DFP/component/mem2mem.h
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief MEM2MEM register API structure */
typedef struct
{
  __IO  uint32_t                       MEM2MEM_THR;        /**< Offset: 0x00 (R/W  32) Transfer Holding Register */
  __IO  uint32_t                       MEM2MEM_MR;         /**< Offset: 0x04 (R/W  32) Mode Register */
  __O   uint32_t                       MEM2MEM_IER;        /**< Offset: 0x08 ( /W  32) Interrupt Enable Register */
  __O   uint32_t                       MEM2MEM_IDR;        /**< Offset: 0x0C ( /W  32) Interrupt Disable Register */
  __I   uint32_t                       MEM2MEM_IMR;        /**< Offset: 0x10 (R/   32) Interrupt Mask Register */
  __I   uint32_t                       MEM2MEM_ISR;        /**< Offset: 0x14 (R/   32) Interrupt Status Register */
  __IO  uint32_t                       MEM2MEM_WPMR;       /**< Offset: 0x18 (R/W  32) Write Protection Mode Register */
  __I   uint8_t                        Reserved1[0xE4];
  __IO  uint32_t                       MEM2MEM_RPR;        /**< Offset: 0x100 (R/W  32) Receive Pointer Register */
  __IO  uint32_t                       MEM2MEM_RCR;        /**< Offset: 0x104 (R/W  32) Receive Counter Register */
  __IO  uint32_t                       MEM2MEM_TPR;        /**< Offset: 0x108 (R/W  32) Transmit Pointer Register */
  __IO  uint32_t                       MEM2MEM_TCR;        /**< Offset: 0x10C (R/W  32) Transmit Counter Register */
  __IO  uint32_t                       MEM2MEM_RNPR;       /**< Offset: 0x110 (R/W  32) Receive Next Pointer Register */
  __IO  uint32_t                       MEM2MEM_RNCR;       /**< Offset: 0x114 (R/W  32) Receive Next Counter Register */
  __IO  uint32_t                       MEM2MEM_TNPR;       /**< Offset: 0x118 (R/W  32) Transmit Next Pointer Register */
  __IO  uint32_t                       MEM2MEM_TNCR;       /**< Offset: 0x11C (R/W  32) Transmit Next Counter Register */
  __O   uint32_t                       MEM2MEM_PTCR;       /**< Offset: 0x120 ( /W  32) Transfer Control Register */
  __I   uint32_t                       MEM2MEM_PTSR;       /**< Offset: 0x124 (R/   32) Transfer Status Register */
  __IO  uint32_t                       MEM2MEM_PWPMR;      /**< Offset: 0x128 (R/W  32) Write Protection Mode Register */
} mem2mem_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _PIC32CXMTC_MEM2MEM_COMPONENT_H_ */
